Repository: MArtem/MVVMExample
Catalog: AllArchitectureCases/09-reactorkit-reactor-style/ReactorStyleCase/Localizable.xcstrings
Source language: en
Languages: ru

source: %d comments
ru: %d комментариев

source: %d likes
ru: %d лайков

source: Add to favorites
ru: Добавить в избранное

source: Cancel
ru: Отменить

source: Comments %@
ru: Комментарии: %@

source: Couldn’t load details
ru: Не удалось загрузить детали

source: Couldn’t load news
ru: Не удалось загрузить новости

source: Couldn’t load profile
ru: Не удалось загрузить профиль

source: Couldn’t refresh. Showing previous content.
ru: Не удалось обновить. Показан предыдущий контент.

source: Couldn’t update favorite. Please try again.
ru: Не удалось обновить избранное. Попробуйте ещё раз.

source: Couldn’t update like. Please try again.
ru: Не удалось обновить лайк. Попробуйте ещё раз.

source: Details
ru: Детали

source: Edit profile
ru: Редактировать профиль

source: Edit Profile
ru: Редактировать профиль

source: Fill demo credentials
ru: Заполнить демо-данные

source: First name
ru: Имя

source: General
ru: Общее

source: Last name
ru: Фамилия

source: Like article
ru: Поставить лайк статье

source: Likes %@
ru: Лайки: %@

source: Loading details...
ru: Загрузка деталей…

source: Loading news...
ru: Загрузка новостей…

source: Loading profile...
ru: Загрузка профиля…

source: Logout
ru: Выйти

source: New cards will appear here when the API returns data.
ru: Новые карточки появятся здесь, когда API вернёт данные.

source: News
ru: Новости

source: No company title
ru: Должность не указана

source: No news yet
ru: Новостей пока нет

source: No phone
ru: Телефон не указан

source: Opens article details
ru: Открывает детали статьи

source: Password
ru: Пароль

source: Personal
ru: Личные данные

source: Phone
ru: Телефон

source: Profile
ru: Профиль

source: Rating %.1f
ru: Рейтинг %.1f

source: Rating %@
ru: Рейтинг: %@

source: Recently
ru: Недавно

source: Remove from favorites
ru: Удалить из избранного

source: Retry
ru: Повторить

source: Retry loading more
ru: Повторить загрузку

source: Role
ru: Роль

source: Save
ru: Сохранить

source: Saving...
ru: Сохранение…

source: Sign In
ru: Войти

source: Signing in...
ru: Вход…

source: Something went wrong. Please try again.
ru: Что-то пошло не так. Попробуйте ещё раз.

source: The network request failed. Please try again.
ru: Сетевой запрос не выполнен. Попробуйте ещё раз.

source: The request took too long. Please try again.
ru: Запрос выполнялся слишком долго. Попробуйте ещё раз.

source: The request was cancelled.
ru: Запрос был отменён.

source: The server could not complete the request. Please try again.
ru: Сервер не смог выполнить запрос. Попробуйте ещё раз.

source: Unlike article
ru: Убрать лайк со статьи

source: Use DummyJSON demo login
ru: Используйте демо-вход DummyJSON

source: Username
ru: Имя пользователя

source: We couldn’t process the server response. Please try again later.
ru: Не удалось обработать ответ сервера. Попробуйте позже.

source: You appear to be offline. Check your connection and try again.
ru: Похоже, вы офлайн. Проверьте подключение и попробуйте снова.

source: You don’t have permission to perform this action.
ru: У вас нет разрешения выполнить это действие.

source: You’re all caught up
ru: Вы всё посмотрели

source: Your session expired. Please sign in again.
ru: Сессия истекла. Войдите снова.
